<?php
$id=$_GET["uc"];
require('deces.php');
$pdf = new deces( 'P', 'mm', 'A4',true,'UTF-8',false );
$pdf->setPrintHeader(false);$pdf->SetAutoPageBreak(TRUE, 0);$pdf->setPrintFooter(false);
$pdf->AddPage('P','A4');
$pdf->setRTL(true); 
$pdf->RoundedRect($x=5, $y=5, $w=200, $h=285, $r=2, $round_corner='1111', $style='', $border_style=array(), $fill_color=array());
$pdf->RoundedRect($x=145, $y=46, $w=1, $h=244, $r=2, $round_corner='1111', $style='', $border_style=array(), $fill_color=array());
$pdf->SetFont('aefurat', '', 14);
$pdf->SetXY(5,10);$pdf->Cell(200,6,$pdf->repar,0,1,'C');
$pdf->SetXY(5,20);$pdf->Cell(200,6,$pdf->mspar,0,1,'C');
$pdf->SetXY(5,30);$pdf->Cell(200,6,$pdf->dspar,0,1,'C');
$pdf->SetFillColor(245);
$pdf->SetXY(65+5,$pdf->GetY()+10);$pdf->Cell(140-10,15,'التصريح بالولادة',1,1,'C',1,0);
$pdf->SetXY(5+5,$pdf->GetY()-15);$pdf->Cell(50,15,'الموسسة العمومية الاستشفائية',1,1,'C',1,0);
$pdf->SetXY(5+5,$pdf->GetY());$pdf->Cell(50,15,'سعداوي المختار',1,1,'C',1,0);
$pdf->Text(65,$pdf->GetY()-10,$pdf->ANNEEAR(date('Y-m-d')));$pdf->Text(65+20,$pdf->GetY(),'..........................................................................................');
$pdf->Text(65,$pdf->GetY()+10,$pdf->JOURAR(date('Y-m-d')));$pdf->Text(65+20,$pdf->GetY(),'..........................................................................................');
$pdf->Text(65,$pdf->GetY()+10,$pdf->MOISAR(date('Y-m-d')));$pdf->Text(65+20,$pdf->GetY(),'..........................................................................................');
$pdf->Text(65,$pdf->GetY()+10,"نحن :".'...............');
$pdf->Text(65+30,$pdf->GetY(),"مدير المؤسسة العمومية ".'................................................');
$pdf->Text(65,$pdf->GetY()+10,"نشعر رئيس المجلس الشعبي البلدي  ضابط الحلة المدنية ببلدية :".'...................');
$pdf->Text(65,$pdf->GetY()+10,"قي هذا اليوم و على الساعة :");$pdf->Text(60+55,$pdf->GetY(),"..................................................................");
$pdf->Text(65,$pdf->GetY()+10,"والدقيقة :");$pdf->Text(82,$pdf->GetY(),".............................................................................................");
$pdf->Text(65,$pdf->GetY()+10,"السيدة :");$pdf->Text(82,$pdf->GetY(),".............................................................................................");
$pdf->Text(65,$pdf->GetY()+10,"المولودة :".' ........................');$pdf->Text(65+50,$pdf->GetY(),"بـ :".' ............................................................');
$pdf->Text(65,$pdf->GetY()+10,"مهنتها :"." ...............................................................................................");
$pdf->Text(65,$pdf->GetY()+10," و زوجها :"." ...........................................................................................");$pdf->Text(65+25,$pdf->GetY(),"");
$pdf->Text(65,$pdf->GetY()+10,"المولود :".' ........................');$pdf->Text(65+50,$pdf->GetY(),"بـ :".' ............................................................');
$pdf->Text(65,$pdf->GetY()+10,"مهنته :"." ................................................................................................");
$pdf->Text(65,$pdf->GetY()+10,"الساكنان :"." ...........................................................................................");
$pdf->Text(65,$pdf->GetY()+10,"والتي وضعة صبي (ة) من جنس  :".' ...........................');$pdf->Text(158,$pdf->GetY(),"على قيد الحياة - متوفي ");
$pdf->Text(65,$pdf->GetY()+10,"واعطي له  (ها)  اسم :".' ..........................................................................');
$pdf->Text(129,$pdf->GetY()+25,"في : ".date('Y-m-d'));
$pdf->Text(25,$pdf->GetY()-10,"امضاء الطبيب");                             $pdf->Text(150,$pdf->GetY(),"امضاء المدير");
$pdf->SetXY(5,$pdf->GetY()+10);$pdf->Cell(60,6,".......................................... ",0,1,'C');
$pdf->Text(5,$pdf->GetY()+10,"الكتابة السابقة للاسم و اللقب :");
$pdf->Text(7,$pdf->GetY()+10,"_____________________");
$pdf->Text(7,$pdf->GetY()+10,"_____________________");
$nec =999;
$pdf->SetXY(10,80);$pdf->Cell(50,15,'الرقم : '.date('Y').'/'.$nec,1,1,'C',1,0);
$pdf->SetXY(10,120);$pdf->Cell(50,10,'دفتر عائلي رقم : '.$nec,1,1,'C',1,0);
$pdf->SetXY(10,135);$pdf->Cell(50,10,'صادر بتاريخ : '.date('Y-m-d'),1,1,'C',1,0);
$pdf->SetXY(10,150);$pdf->Cell(50,10,'الجلفة',1,1,'C',1,0);
$pdf->SetFont('helvetica', '', 10);
// define barcode style
$style = array(
    'position' => '',
    'align' => 'R',
    'stretch' => false,
    'fitwidth' => false,
    'cellfitalign' => '',
    'border' => false,
    'hpadding' => 'auto',
    'vpadding' => 'auto',
    'fgcolor' => array(0,0,0),
    'bgcolor' => false, //array(255,255,255),
    'text' => true,
    'font' => 'helvetica',
    'fontsize' => 8,
    'stretchtext' => 4
);
// CODE 39 - ANSI MH10.8M-1983 - USD-3 - 3 of 9.
//$pdf->SetXY(70,100);$pdf->Cell(0, 0, 'CODE 39 - ANSI MH10.8M-1983 - USD-3 - 3 of 9', 0, 1);
$pdf->SetXY(10,99);$pdf->write1DBarcode($nec, 'C39', '', '', '', 18, 0.4, $style, 'N');
$pdf->Ln();
$pdf->Output();
?>


